#ifndef __OLED_Font_H
#define __OLED_Font_H     

#include "ti_msp_dl_config.h"

// ==========================================================================
// 16行*16列汉字点阵表，每个字符占用 16*16/8=32 字节
// 中景园电子科技
extern const uint8_t Front_16x16Tab[][32];

// ==========================================================================
// 95个常用 ASCII字符。16*8 点阵, 每个字符 16 字节
extern const uint8_t Front_16x8Tab[][16];

// ==========================================================================
// 92个常用 ASCII字符。 8*6 点阵, 每个字符  6 字节
extern uint8_t const  Front_8x6Tab[][6];

#endif

// ==========================================================================
// End of file.
